app/controllers/artists_controller.rb

INSERT INTO `artists` (`name`, `external_id`, `oauth_secret`, `song_count`, `oauth_token`, `screen_name`) VALUES('Tupac', NULL, 'hfLo16OPsem9pKpJOwvYhbEF9uWyKolJhMb1NPqSmMg', NULL, '148377130-4obU0ll5MMO3ybzb4HHWv4Ckrn1MhoFFRt9GM1ai', 'TupacSays')
---
  def create
    @artist = Artist.create(params[:artist])